Public Attributes | List of all members
API_AnalyticalLink_Translation Struct Reference
Analytical Model
Describe the translation of an analitycal link. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalRigidityType  | kxType
Rigidity type in X direction.
 double  | kxValue
Rigidity value in X direction.
 API_AnalyticalRigidityType  | kyType
Rigidity type in Y direction.
 double  | kyValue
Rigidity value in Y direction.
 API_AnalyticalRigidityType  | kzType
Rigidity type in Z direction.
 double  | kzValue
Rigidity value in Z direction.
 bool  | resistanceFx
Resistance value along the X axis.
 bool  | resistanceFy
Resistance value along the Y axis.
 bool  | resistanceFz
Resistance value along the Z axis.
 double  | fxValue
Rotation value in X direction.
 double  | fyValue
Rotation value in Y direction.
 double  | fzValue
Rotation value in Z direction.
Detailed Description
Describe the translation of an analitycal link.
Since
Archicad 25